#+SETUPFILE: base-template.org
#+TITLE:    Convertisseur de base
#+SUBTITLE:     Activités #3
#+PROPERTY: header-args :results output replace :exports none

#+BEGIN_abstract
  Le but de cette activité est de développer une application web qui convertit un nombre d'une base vers une autre. Les bases doivent être comprises entre 2 et 36.
#+END_abstract
* Conversion depuis une base comprise entre 2 et 36

  Écrire la fonction ~DecodeNumber~, une version simplifiée de la fonction prédéfinie ~strtoi~.

#+NAME: template1
#+BEGIN_SRC R :exports code
  #' Décode une chaîne de caractère word représentant un nombre n écrit dans une base comprise entre 2 et 36. 
  #'
  #' @param word la chaîne de caractère représentant le nombre ne contenant que des caractères alphanumériques.
  #' @param base la base dans laquelle est écrite le nombre
  #' @return le nombre n ou NA si le format de la chaîne est invalide.
  DecodeNumber <- function(word, base) {
    return(NA)
  }
#+END_SRC

Voici le résultat de la fonction avec des nombres correctement formatés.
 #+BEGIN_SRC R :exports both :session convert
   DecodeNumber("121", 10);
   DecodeNumber("1010", 2);
   DecodeNumber("1A", 16);
   DecodeNumber("1Az", 36);
 #+END_SRC

 #+RESULTS:
 : [1] 121
 : [1] 10
 : [1] 26
 : [1] 1691
 
 Le format du nombre est incorrect lorsqu'au moins un chiffre est supérieur ou égal à la base.
 #+BEGIN_SRC R :exports both :session convert
   DecodeNumber("121A", 10);
 #+END_SRC

 #+RESULTS:
 : [1] NA

 Pour vous aider, la fonction ~DecodeDigit~ prend en paramètre une chaîne de caractères et renvoie le vecteur des chiffres du nombre.  
 
 #+BEGIN_SRC R :exports both :session convert
   alphabet <- c(0:9, LETTERS)
   alphabet
   DecodeDigits(alphabet);
 #+END_SRC

 #+RESULTS:
 :  [1] "0" "1" "2" "3" "4" "5" "6" "7" "8" "9" "A" "B" "C" "D" "E" "F" "G" "H" "I"
 : [20] "J" "K" "L" "M" "N" "O" "P" "Q" "R" "S" "T" "U" "V" "W" "X" "Y" "Z"
 :  [1]  0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24
 : [26] 25 26 27 28 29 30 31 32 33 34 35
 : [1]  1 NA  2

* Conversion vers une base entre 2 et 36
  Écrire la fonction réciproque ~EncodeNumber~.
#+NAME: template2
#+BEGIN_SRC R :exports code
  #' Écrit le nombre n dans une chaîne de caractères en utilisant un base comprise entre 2 et 36
  #' @param n le nombre à encoder
  #' @param base la base dans laquelle écrire le nombre
  #' @return la chaîne de caractère contenant le nombre n écrit dans la base
  EncodeNumber <- function(n, base) {
    return(NA)
  } 
#+END_SRC

Quelques exemples d'appels.
 #+BEGIN_SRC R :exports both :session convert
   EncodeNumber(60, 10);
   EncodeNumber(60, 2);
   EncodeNumber(60, 16);
   EncodeNumber(61, 36);
 #+END_SRC

 #+RESULTS:
 : [1] "60"
 : [1] "111100"
 : [1] "3C"
 : [1] "1P"

* Conversion vers bibi-binaire
  Écrire la fonction réciproque ~EncodeBibi~ qui prend en paramètre un nombre ~n~ et renvoie une chaîne de caractère, le nombre ~n~ écrit avec le [[https://fr.wikipedia.org/wiki/Syst%25C3%25A8me_bibi-binaire][système bibi-binaire]].

#+NAME: template3
#+BEGIN_SRC R :exports code
  #' Écrit un nombre n dans une chaîne de caractère avec le système bibi-binaire
  #' @param n le nombre à encoder
  #' @return la chaîne de caractère contenant le nombre n écrit en bibi-binaire
  EncodeBibi <- function(n) {
    return(NA)
  }
#+END_SRC
Quelques exemples d'appels.
 #+BEGIN_SRC R :exports both :session convert
   EncodeBibi(60);
   EncodeBibi(2018);
 #+END_SRC

 #+RESULTS:
 : [1] "HIDO"
 : [1] "BIDEHE"

